/*
 Navicat Premium Data Transfer

 Source Server         : shop_store_management
 Source Server Type    : MySQL
 Source Server Version : 50721
 Source Host           : localhost:3306
 Source Schema         : shop_store_management

 Target Server Type    : MySQL
 Target Server Version : 50721
 File Encoding         : 65001

 Date: 04/03/2019 22:47:55
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for admin_user
-- ----------------------------
DROP TABLE IF EXISTS `admin_user`;
CREATE TABLE `admin_user`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(40) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `pwd` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `createAt` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = MyISAM AUTO_INCREMENT = 6 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of admin_user
-- ----------------------------
INSERT INTO `admin_user` VALUES (1, 'pwx', '123', '2019-01-07 21:28:26');
INSERT INTO `admin_user` VALUES (4, '15553509117', '827ccb0eea8a706c4c34a16891f84e7b', '2019-01-17 22:17:07');
INSERT INTO `admin_user` VALUES (5, '15553598117', '827ccb0eea8a706c4c34a16891f84e7b', '2019-01-20 22:14:43');

-- ----------------------------
-- Table structure for book_author
-- ----------------------------
DROP TABLE IF EXISTS `book_author`;
CREATE TABLE `book_author`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = MyISAM AUTO_INCREMENT = 1 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for book_category
-- ----------------------------
DROP TABLE IF EXISTS `book_category`;
CREATE TABLE `book_category`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = MyISAM AUTO_INCREMENT = 1 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for book_category_map
-- ----------------------------
DROP TABLE IF EXISTS `book_category_map`;
CREATE TABLE `book_category_map`  (
  `book_id` int(11) NULL DEFAULT NULL,
  `categoryId` int(11) NULL DEFAULT NULL
) ENGINE = MyISAM CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Fixed;

-- ----------------------------
-- Table structure for book_list
-- ----------------------------
DROP TABLE IF EXISTS `book_list`;
CREATE TABLE `book_list`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `author` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `press` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `title` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `description` varchar(500) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `stock` int(11) NOT NULL,
  `price` float(10, 2) NOT NULL,
  `salePrice` float(10, 2) NOT NULL,
  `isSell` int(1) NOT NULL DEFAULT 1,
  `imageUrl` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `createAt` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP,
  `updateAt` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = MyISAM AUTO_INCREMENT = 139 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of book_list
-- ----------------------------
INSERT INTO `book_list` VALUES (1, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-21 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (2, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (3, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (4, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (5, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (6, '三体', '刘慈欣', '清华大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (7, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (8, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (9, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (10, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (11, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (12, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (13, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (14, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (15, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (16, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (17, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (18, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (19, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (20, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (21, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (22, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (23, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (24, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (25, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (26, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (27, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (28, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (29, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (30, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (31, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (32, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (33, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (34, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (35, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (36, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (37, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (38, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (39, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (40, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (41, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (42, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (43, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (44, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (45, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (46, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (47, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (48, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (49, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (50, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (51, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (52, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (53, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (54, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (55, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (56, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (57, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (58, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (59, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (60, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (61, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (62, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (63, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (64, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (65, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (66, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (67, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (68, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (69, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (70, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (71, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (72, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (73, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (74, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (75, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (76, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (77, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (78, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (79, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (80, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (81, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (82, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (83, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (84, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (85, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (86, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (87, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (88, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (89, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (90, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (91, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (92, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (93, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (94, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (95, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (96, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (97, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (98, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (99, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (100, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (101, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (102, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (103, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (104, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (105, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (106, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (107, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (108, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (109, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (110, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (111, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (112, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (113, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (114, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (115, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (116, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (117, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (118, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (119, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (120, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (121, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (122, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (123, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (124, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (125, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (126, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (127, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (128, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (129, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (130, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (131, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (132, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (133, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (134, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (135, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (136, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (137, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');
INSERT INTO `book_list` VALUES (138, '三体', '刘慈欣', '北京师范大学出版社', '特价小搜', '中国科幻巨作', 66, 55.50, 53.00, 1, NULL, '2019-02-20 21:35:09', '2019-02-20 21:35:09');

-- ----------------------------
-- Table structure for shop_user
-- ----------------------------
DROP TABLE IF EXISTS `shop_user`;
CREATE TABLE `shop_user`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `nickname` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `pwd` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `sex` int(1) NULL DEFAULT NULL,
  `mobile` varchar(11) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `email` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `createAt` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = MyISAM AUTO_INCREMENT = 1 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

SET FOREIGN_KEY_CHECKS = 1;
